In [99]:
import pandas as pd
import numpy as np
import seaborn as sns

In [81]:
data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Alice', 'Bob', 'Emily', 'Michael'],
    'Age': [20, 21, 19, 20, 22],
    'Math_Score': [85, 90, 75, np.nan, 88],
    'Science_Score': [78, 85, np.nan, 92, 80],
    'English_Score': [82, 88, 75, 90, 85]
}

In [83]:
df=pd.DataFrame(data)
df

   Student_ID     Name  Age  Math_Score  Science_Score  English_Score
0           1     John   20        85.0           78.0             82
1           2    Alice   21        90.0           85.0             88
2           3      Bob   19        75.0            NaN             75
3           4    Emily   20         NaN           92.0             90
4           5  Michael   22        88.0           80.0             85

In [85]:
df.isnull().sum()

Student_ID       0
Name             0
Age              0
Math_Score       1
Science_Score    1
English_Score    0
dtype: int64

In [87]:
#replace null values with mean value
mean=df["Math_Score"].mean()
df["Math_Score"]=df["Math_Score"].fillna(mean)

mean1=df["Science_Score"].mean()
df["Science_Score"]=df["Science_Score"].fillna(mean1)

In [90]:
df

   Student_ID     Name  Age  Math_Score  Science_Score  English_Score
0           1     John   20        85.0          78.00             82
1           2    Alice   21        90.0          85.00             88
2           3      Bob   19        75.0          83.75             75
3           4    Emily   20        84.5          92.00             90
4           5  Michael   22        88.0          80.00             85

In [111]:
df.boxplot()

In [113]:
newdf=df[df["Math_Score"]>80]

In [96]:
newdf

   Student_ID     Name  Age  Math_Score  Science_Score  English_Score
0           1     John   20        85.0           78.0             82
1           2    Alice   21        90.0           85.0             88
3           4    Emily   20        84.5           92.0             90
4           5  Michael   22        88.0           80.0             85

In [98]:
newdf.boxplot()